x = ['曹','赵','关','张','赵','刘','诸葛','司马','郑','韩',
     '孙','吴','陈','郭','崔','钟','吕','贾','杨','邓']

a='陶万艳陶万雪陶三蓉陶专英陶世妹陶世媛陶世莹陶丛玥陶之玥陶乐冉陶习茹陶习莉陶习莹陶书玥陶二蓉陶云婵陶云莹陶亦娟陶亦琴陶亦萍陶亿英陶仔怡陶仙婧陶仙文陶仙琳陶仙萍陶仙雪陶仟倩陶仟茹陶以霞陶仪娜陶仲雪陶优美陶传莹陶佐萍陶余悦陶佩雪陶依娟陶侦媛陶俏玉陶俐冉陶俣倩陶俪婧陶俪颖陶倩宏陶倩沁陶倩洳陶倩璐陶倩芯陶倩菱陶儒玉陶克燕陶其倩陶其燕陶其蓉陶冉玲陶军倩陶冼妹陶净芳陶刘英陶初霞陶制燕陶加媛陶卉倩陶厚丽陶厚琴陶原红陶原霞陶发美陶叔丽陶名冉陶名琳陶君嫣陶吟莹陶含艳陶启蓉陶咨妍陶啊玉陶喜妍陶喜玉陶喜美陶喻霞陶四蓉陶园莉陶垭萍陶基娜陶墨丽陶墨莹陶太玉陶妍光陶妍同陶妍忮陶妍枝陶妍榛陶妍缈陶妍翘陶妙燕陶妲倩陶妹润竦布欣乐天璞玉流逸昕雨可琪仓艳紫杉秦峰驰涵一瑾宏伟高杰智宸楚洁稽宏清悦珴子裕粼淙暄文忆雪彩玉河清忻愉文思旭辉帝辉梦菲聪慧梓柔锐进姝莹白姜荣清馨盾墨歆然志诚可然燕婉冠宇寅鑫黛娥忻欢宝华依秋松文田然兴昌宣朗修齐良俊一帆红旭佩琳秉荃如冰霞姝可然秦剑鼎蓼秀华真茹丽姿秀雅可俊英粟麓瀚海璧烨烨欣欣耘志柯凡辰伟振博鸿禧曼容盈秀朕和悦翠茵鸿飞靖琪弼畴墉绪颖萍运浩广琼岚飞语秀筠梦竹夏岚心远心桐昕妤怀思晋荣彤贶宁鸿振飞龙维运楼之综骞尧唅唅珊宛儿智纯伶伶昊乾桂帆依秋伟诚梓洁晨星艺菲晴丽哲兴学楚洁黛妍和雼翔俊瑰玮宏儒亿阳曦牧歌玟希慕茂典天赋萌阳浦泽文漪苍宇烨烨弘宥恭和品韵宗竹萱和蒲凡诗怀凡羽冰枫苑涵涵晨达鹤轩韦柔德本墨夏萱泰华启颜乐池驹乐怡贶宁清润悦乐慧巧阳煦宛妙涵畅曦之祺祥问萍荣彬静涵易楠秀文子琳泽雨诗文弘济秀洁珺琦跃升璞玉雪卉春雪高杰梓文伟茂程举存安楚楚胤文则蕊雅洁楚洁玮泽惠职君寻芳颜琛米米慧婕欧仙仪皎洁鸿晖寅祥越彬守仁高卓问筠欣怡驰鸿致远濡霈安妮承业红英吉森海莹吉月浩思璞瑜俊慧建业帅红铭晨曦哲春兰凌春文乐贶宁美偲嘉玉桐霏清心路遥亚楠慧美弓仑'

ming_list = list(set(a))

sex = ['男','女']
import random
f = open('teacher.txt','w')
for i in range(800):
    xing = random.choice(x)
    ming = ''.join(random.sample(a,2))
    name = xing+ming
    s = 'insert into student(sname,gender,class_id) value("%s","%s",%s);\n'%(name,\
        random.choice(sex),random.randint(1,29))
    f.write(s)
f.close()


